khosta77/stm32f4_OV7670_CMSIS/src/main.c
#include "../system/include/cmsis/stm32f4xx.h"
#include "../system/include/stm32f4-hal/stm32f4xx_hal.h"
#include <stdbool.h>
//===========================================================================================================
#if 0
// SCCB write address
#define SCCB_REG_ADDR 		0x01

// OV7670 camera settings
#define OV7670_REG_NUM 		121
#define OV7670_WRITE_ADDR 	0x42

// Image settings
#define IMG_ROWS            144
#define IMG_COLUMNS   		174

uint8_t temp_buffer[IMG_ROWS * IMG_COLUMNS];
//int frame_flag = 0;
volatile uint16_t frame_buffer[IMG_ROWS * IMG_COLUMNS];
I2C_HandleTypeDef I2C_InitStructure;

static volatile bool frame_flag = false;
static volatile bool send_sync_frame = false;

const uint8_t OV7670_reg[OV7670_REG_NUM][2] = { 
    { 0x12, 0x80 },
// Image format
	{ 0x12, 0x8  },	 // 0x14 = QVGA size, RGB mode; 0x8 = QCIF, YUV, 0xc = QCIF (RGB)
	{ 0xc,  0x8  },  //
	{ 0x11, 0x40 },  //
	{ 0xb0, 0x84 },	 // Color mode (Not documented??)
// Hardware window
	{ 0x11, 0x01 },  // PCLK settings, 15fps
	{ 0x32, 0x80 },	 // HREF
	{ 0x17, 0x17 },	 // HSTART
	{ 0x18, 0x05 },	 // HSTOP
	{ 0x03, 0x0a },	 // VREF
	{ 0x19, 0x02 },	 // VSTART
	{ 0x1a, 0x7a },	 // VSTOP
// Scalling numbers
	{ 0x70, 0x3a },	 // X_SCALING
	{ 0x71, 0x35 },	 // Y_SCALING
	{ 0x72, 0x11 },	 // DCW_SCALING
	{ 0x73, 0xf0 },	 // PCLK_DIV_SCALING
	{ 0xa2, 0x02 },	 // PCLK_DELAY_SCALING
// Matrix coefficients
	{ 0x4f, 0x80 },  //
	{ 0x50, 0x80 },  //
	{ 0x51, 0x00 },  //
	{ 0x52, 0x22 },  //
	{ 0x53, 0x5e },  //
	{ 0x54, 0x80 },  //
	{ 0x58, 0x9e },
// Gamma curve values
	{ 0x7a, 0x20 },  //
	{ 0x7b, 0x10 },  //
	{ 0x7c, 0x1e },  //
	{ 0x7d, 0x35 },  //
	{ 0x7e, 0x5a },  //
	{ 0x7f, 0x69 },  //
	{ 0x80, 0x76 },  //
	{ 0x81, 0x80 },  //
	{ 0x82, 0x88 },  //
	{ 0x83, 0x8f },  //
	{ 0x84, 0x96 },  //
	{ 0x85, 0xa3 },  //
	{ 0x86, 0xaf },  //
	{ 0x87, 0xc4 },  //
	{ 0x88, 0xd7 },  //
	{ 0x89, 0xe8 },
// AGC and AEC parameters
	{ 0xa5, 0x05 },  //
	{ 0xab, 0x07 },  //
	{ 0x24, 0x95 },  //
	{ 0x25, 0x33 },  //
	{ 0x26, 0xe3 },  //
	{ 0x9f, 0x78 },  //
	{ 0xa0, 0x68 },  //
	{ 0xa1, 0x03 },  //
	{ 0xa6, 0xd8 },  //
	{ 0xa7, 0xd8 },  //
	{ 0xa8, 0xf0 },  //
	{ 0xa9, 0x90 },  //
	{ 0xaa, 0x94 },  //
	{ 0x10, 0x00 },
// AWB parameters
	{ 0x43, 0x0a },  //
	{ 0x44, 0xf0 },  //
	{ 0x45, 0x34 },  //
	{ 0x46, 0x58 },  //
	{ 0x47, 0x28 },  //
	{ 0x48, 0x3a },  //
	{ 0x59, 0x88 },  //
	{ 0x5a, 0x88 },  //
	{ 0x5b, 0x44 },  //
	{ 0x5c, 0x67 },  //
	{ 0x5d, 0x49 },  //
	{ 0x5e, 0x0e },  //
	{ 0x6c, 0x0a },  //
	{ 0x6d, 0x55 },  //
	{ 0x6e, 0x11 },  //
	{ 0x6f, 0x9f },  //
	{ 0x6a, 0x40 },  //
	{ 0x01, 0x40 },  //
	{ 0x02, 0x60 },  //
	{ 0x13, 0xe7 },
// Additional parameters
	{ 0x34, 0x11 },  //
	{ 0x3f, 0x00 },  //
	{ 0x75, 0x05 },  //
	{ 0x76, 0xe1 },  //
	{ 0x4c, 0x00 },  //
	{ 0x77, 0x01 },  //
	{ 0xb8, 0x0a },  //
	{ 0x41, 0x18 },  //
	{ 0x3b, 0x12 },  //
	{ 0xa4, 0x88 },  //
	{ 0x96, 0x00 },  //
	{ 0x97, 0x30 },  //
	{ 0x98, 0x20 },  //
	{ 0x99, 0x30 },  //
	{ 0x9a, 0x84 },  //
	{ 0x9b, 0x29 },  //
	{ 0x9c, 0x03 },  //
	{ 0x9d, 0x4c },  //
	{ 0x9e, 0x3f },  //
	{ 0x78, 0x04 },  //
	{ 0x0e, 0x61 },  //
	{ 0x0f, 0x4b },  //
	{ 0x16, 0x02 },  //
	{ 0x1e, 0x00 },  //
	{ 0x21, 0x02 },  //
	{ 0x22, 0x91 },  //
	{ 0x29, 0x07 },  //
	{ 0x33, 0x0b },  //
	{ 0x35, 0x0b },  //
	{ 0x37, 0x1d },  //
	{ 0x38, 0x71 },  //
	{ 0x39, 0x2a },  //
	{ 0x3c, 0x78 },  //
	{ 0x4d, 0x40 },  //
	{ 0x4e, 0x20 },  //
	{ 0x69, 0x00 },  //
	{ 0x6b, 0x3a },  //
	{ 0x74, 0x10 },  //
	{ 0x8d, 0x4f },  //
	{ 0x8e, 0x00 },  //
	{ 0x8f, 0x00 },  //
	{ 0x90, 0x00 },  //
	{ 0x91, 0x00 },  //
    { 0x96, 0x00 },  //
	{ 0x9a, 0x00 },  //
	{ 0xb1, 0x0c },  //
    { 0xb2, 0x0e },  //
//	{ 0xb3, 0x82 },  //
//	{ 0x4b, 0x01 } 
};

void Delay(uint32_t nCount) {
	while (nCount--) {
    }
}
//===========================================================================================================
void I2C2_init() {
#if 0
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR10 | GPIO_OSPEEDER_OSPEEDR11;
    GPIOB->MODER |= GPIO_MODER_MODER10_1 | GPIO_MODER_MODER11_1;  // SCL | SDA
    GPIOB->OTYPER |= GPIO_OTYPER_OT_10 | GPIO_OTYPER_OT_11;
    GPIOB->PUPDR |= GPIO_PUPDR_PUPDR10_0 | GPIO_PUPDR_PUPDR11_0;
    GPIOB->AFR[1] |= ((0x4 << 8) | (0x4 << 12));//GPIO_AFRH_AFRH10_2 | GPIO_AFRH_AFRH11_2;

    RCC->APB1ENR |= RCC_APB1ENR_I2C2EN ;
    I2C2->CR2 = 0x2A;
    I2C2->CCR = 0xD2;
    I2C2->TRISE = 0x2B;
    I2C2->CR1 |= I2C_CR1_PE;
#else
    GPIO_InitTypeDef GPIO_InitStructure;

	//RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);
	//RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	//RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

    __HAL_RCC_I2C2_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

	// GPIO config
	GPIO_InitStructure.Pin = GPIO_PIN_10;
	GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_LOW;
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Alternate = GPIO_AF4_I2C2;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_InitStructure.Pin = GPIO_PIN_12;
	GPIO_InitStructure.Mode = GPIO_MODE_AF_OD;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_LOW;
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Alternate = GPIO_AF4_I2C2;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

	// GPIO AF config
	//GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C2);
	//GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_I2C2);

	// I2C config
	//I2C_DeInit(I2C2);
    I2C_InitStructure.Instance = I2C2;
    I2C_InitStructure.Init.ClockSpeed = 100000;
    I2C_InitStructure.Init.DutyCycle = I2C_DUTYCYCLE_2;
    I2C_InitStructure.Init.OwnAddress1 = 0x0;
    I2C_InitStructure.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    I2C_InitStructure.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    I2C_InitStructure.Init.OwnAddress2 = 0;
    I2C_InitStructure.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    I2C_InitStructure.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    HAL_I2C_Init(&I2C_InitStructure);

	//I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	//I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	//I2C_InitStructure.I2C_OwnAddress1 = 0x00;
	//I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	//I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	//I2C_InitStructure.I2C_ClockSpeed = 100000;
	//I2C_ITConfig(I2C2, I2C_IT_ERR, ENABLE);
	//I2C_Init(I2C2, &I2C_InitStructure);
	//I2C_Cmd(I2C2, ENABLE);
#endif
}

#define SUCCESS 0
#define ERROR -1
// Ошибка где то здесь

#define I2C2_CMSIS 1
#if I2C2_CMSIS
int SCCB_write_reg(uint8_t reg_addr, uint8_t data) {
#else
bool SCCB_write_reg(uint8_t reg_addr, uint8_t* data) {
#endif
#if I2C2_CMSIS
	uint32_t timeout = 0x7F;



