khosta77/stm32f4_OV7670_CMSIS/src/main.c
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannel = DCMI_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	DMA_Cmd(DMA2_Stream1, ENABLE);
	DCMI_Cmd(ENABLE);
	DCMI_CaptureCmd(ENABLE);
#endif
}
//===========================================================================================================
#define GPIO_AF_MCO    0x00UL

void MCO1_init() {
#if 1
    //enable clock for GPIOA
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
	
    //PA8 -> MCO(AF) -> PLLCLK
    GPIOA->MODER |= GPIO_MODER_MODER8_1; //AF
    GPIOA->OTYPER &= ~GPIO_OTYPER_OT_8; //PP
    GPIOA->PUPDR |= GPIO_PUPDR_PUPDR8_0; //PU
    GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR8; //High speed

    //AF0->MCO
    GPIOA->AFR[1] |= (GPIO_AF_MCO << 0);
    RCC->CFGR &= ~RCC_CFGR_MCO1; //HSI
#else
    GPIO_InitTypeDef GPIO_InitStructure;

	RCC_ClockSecuritySystemCmd(ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

	// GPIO config
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;		//PA8 - XCLK
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	// GPIO AF config
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_MCO);

	// MCO clock source
//	RCC_MCO1Config(RCC_MCO1Source_PLLCLK, RCC_MCO1Div_4); // Using the fast PLL clock results in garbage output, using HSI (at 16Mhz works fine)
	RCC_MCO1Config(RCC_MCO1Source_HSI, RCC_MCO1Div_1);
#endif
}

void TIM4_IRQHandler(void) {
	TIM4->SR &= ~TIM_SR_UIF;
	TIM4->CR1 &= ~TIM_CR1_CEN;
    TIM4->CR1 |= TIM_CR1_CEN;
}

void PWM_init() {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    GPIOD->MODER |= (0x2 << (2 * 12));
    GPIOD->AFR[1] |= (0x2 << 16);
    RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;
    TIM4->PSC = 2;
    TIM4->ARR = 2;
    TIM4->CCMR1 |= 0x60;
    TIM4->CCR1 = 2;
    TIM4->CCER |= 0x1;
    TIM4->DIER |= TIM_DIER_UIE;
    NVIC_EnableIRQ(TIM4_IRQn);
    NVIC_SetPriority(TIM4_IRQn, 2);
    TIM4->CR1 |= TIM_CR1_CEN;
}
//===========================================================================================================
void dumpFrame() {
#if 0
	// Enable capture and DMA after we have sent the photo. This is a workaround for the timing issues I've been having where
	// the DMA transfer is not in sync with the frames being sent
	DMA2_Stream1->NDTR = (IMG_ROWS * IMG_COLUMNS) / 2;
	DMA2_Stream1->CR |= DMA_SxCR_EN;
#else

	uint8_t *buffer = (uint8_t *) frame_buffer;
	int length = IMG_ROWS * IMG_COLUMNS * 2;
	// Copy every other byte from the main frame buffer to our temporary buffer (this converts the image to grey scale)
	int i;
	for (i = 1; i < length; i += 2) {
		temp_buffer[i / 2] = buffer[i];
	}
	// We only send the sync frame if it has been requested
	if (send_sync_frame) {
		for (i = 0x7f; i > 0; i--) {
			uint8_t val = i;
			//Serial_sendb(&val);
		}
		send_sync_frame = false;
	}

	for (i = 0; i < (length / 2); i++) {
		if (i > 100) {
		//	Serial_sendb(&temp_buffer[i]);
		} else {
			uint8_t val = 0xff;
		//	Serial_sendb(&val); // Change first 100 pixels to white to provide a reference for where the frame starts
		}
	}
	// Enable capture and DMA after we have sent the photo. This is a workaround for the timing issues I've been having where
	// the DMA transfer is not in sync with the frames being sent
	//DMA_Cmd(DMA2_Stream1, ENABLE);
	//DCMI_Cmd(ENABLE);
	//DCMI_CaptureCmd(ENABLE);
#endif
}

void my_GPIO_init() {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    GPIOD->MODER |= (GPIO_MODER_MODER13_0 | GPIO_MODER_MODER14_0 | GPIO_MODER_MODER15_0);
    GPIOD->ODR &= ~GPIO_ODR_OD13;
    GPIOD->ODR &= ~GPIO_ODR_OD14;
    GPIOD->ODR &= ~GPIO_ODR_OD15;
}

#if 0
void SystemInit(void)
{
  /* FPU settings ------------------------------------------------------------*/
  #if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
    SCB->CPACR |= ((3UL << 10*2)|(3UL << 11*2));  /* set CP10 and CP11 Full Access */
  #endif
  /* Reset the RCC clock configuration to the default reset state ------------*/
  /* Set HSION bit */
  RCC->CR |= (uint32_t)0x00000001;

  /* Reset CFGR register */
  RCC->CFGR = 0x00000000;

  /* Reset HSEON, CSSON and PLLON bits */
  RCC->CR &= (uint32_t)0xFEF6FFFF;

  /* Reset PLLCFGR register */
  RCC->PLLCFGR = 0x24003010;

  /* Reset HSEBYP bit */
  RCC->CR &= (uint32_t)0xFFFBFFFF;

  /* Disable all interrupts */
  RCC->CIR = 0x00000000;

//#if defined(DATA_IN_ExtSRAM) || defined(DATA_IN_ExtSDRAM)
  SystemInit_ExtMemCtl(); 
//#endif /* DATA_IN_ExtSRAM || DATA_IN_ExtSDRAM */
         
  /* Configure the System clock source, PLL Multiplier and Divider factors, 
     AHB/APBx prescalers and Flash settings ----------------------------------*/
//  SetSysClock();

  /* Configure the Vector Table location add offset address ------------------*/
//#ifdef VECT_TAB_SRAM
  //SCB->VTOR = SRAM_BASE | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal SRAM */
//#else
  //SCB->VTOR = FLASH_BASE | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal FLASH */
//#endif
}
#endif

int main(void) {
#if 0
    GPIO_init();
   // GPIOD->ODR |= GPIO_ODR_OD13;
    I2C2_init();
   // GPIOD->ODR |= GPIO_ODR_OD14;
  //  PWM_init();
  //  GPIOD->ODR |= GPIO_ODR_OD15;
    //MCO1_init();
//	OV7670_init();
	DCMI_init();

   // GPIOD->ODR |= GPIO_ODR_OD13;
    int err;
    err = OV7670_init();
    //GPIOD->ODR |= GPIO_ODR_OD14;
    if (err == ERROR) {
      //  GPIOD->ODR |= GPIO_ODR_OD15;
        while (1) {}
    }

   // GPIOD->ODR |= GPIO_ODR_OD15;
	while(1) {
        if (frame_flag == SUCCESS) {
            //Delay(0xFFF);
			frame_flag = ERROR;
			dumpFrame();
		}
	}
#else
    bool err;

	//SystemInit();
        my_GPIO_init();
	MCO1_init();

	I2C2_init();

    DCMI_init();

    //Serial_init();
      //  GPIOD->ODR |= GPIO_ODR_OD13;

	// Initialize camera over SCCB
	err = OV7670_init();
		GPIOD->ODR |= GPIO_ODR_OD14;

	if (err == true) {
		GPIOD->ODR |= GPIO_ODR_OD14;
        //Serial_log("Failed to initialize\r\n");
		while (1) {
		}
	}

    GPIOD->ODR |= GPIO_ODR_OD15;
	// Infinite program loop
	while (1) {
		if (frame_flag == true) {
			frame_flag = false;
			dumpFrame();
		}
	}
#endif
    
}
#endif



